# AddItem Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RibbonPanel..::..AddItem Method
RibbonPanel Class See Also
---
Adds a Ribbon item to the panel.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public RibbonItem AddItem(
	RibbonItemData itemData
)
```

Visual Basic
---
```text
Public Function AddItem ( _
	itemData As RibbonItemData _
) As RibbonItem
```

Visual C++
---
```text
public:
RibbonItem^ AddItem(
	RibbonItemData^ itemData
)
```

# ### Parameters
itemData
    Type: Autodesk.Revit.UI..::..RibbonItemData Data containing information about the new item.
# ### Return Value
The added Ribbon item.
# Remarks
The new item may either be a PushButton, PulldownButton, SplitButon, RadioButtonGroup, ComboBox, or TextBox depending upon the type of data passed in. The new item may be created as a large-size vertical control in the panel.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when itemData is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when an item with the itemData.Name already exists in the panel or the data is not of the correct type. |

# See Also
RibbonPanel Class
Autodesk.Revit.UI Namespace